
# üß© Titanic Dataset Exploration with pandas

üéØ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why it‚Äôs useful.

In [2]:

import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

# Show first few rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S


# üß† Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

## Head()

Esta funci√≥n ofrece el n√∫mero de resultados que se le env√≠e como argumento siempre empezando por arriba. Por ejemplo, si le env√≠as el n√∫mero 10, te ofrecer√° los primeros 10 resultados. (Por defecto muestra los primeros 5 resultados).

In [3]:

# Ejemplo 1: por defecto, muestra los primeros 5 resultados.

print(df.head())

# Example 2: le pasamos el n√∫mero 10 como par√°metro, 
# por lo tanto, muestra los primeros 10 resultados.

df.head(10)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

## Tail()

Al contrario de head(), que te muestra los resultados desde el principio, tail() te ofrece los resultados a partir del final del dataframe. Es decir, si le pasamos el mismo n√∫mero que en ejemplo anterior, tail nos devolver√° los √∫ltimos 10 resultados (tambi√©n devuelve 5 por defecto).

In [4]:
# Ejemplo 1: por defecto, muestra los 5 √∫ltimos.

print(df.tail())

# Ejemplo 2: devuelve los √∫ltimos 10 resultados del dataframe.

df.tail(10)

     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Info()

Info() nos da informaci√≥n sobre los tipos de datos, el numero de no nulos y el espacio en memoria. Tambi√©n el n√∫mero total de columnas y otros tipos de informaci√≥n sobre el dataset.

In [5]:
# Ejemplo 1: muestra los datos del dataframe donde se ejecuta. Muestra el total de entradas y columnas,
# posteriomente te muestra las cabeceras de las columnas con la informaci√≥n de cada una de ellas. Tambi√©n
# muestra el n√∫mero de diferentes tipos de datos y el espacio de memoria ocupado por el dataframe.

print(df.info())

# Ejemplo 2: muestra la informaci√≥n detallada de la columna seleccionada.

print(df[["Cabin"]].info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Cabin   204 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB
None

## Describe()

Describe() nos proporciona informaci√≥n estad√≠stica sobre los datos, ademas de los cuartiles, la media y la desviaci√≥n t√≠pica. Tambi√©n nos da los maximos, m√≠nimos y n√∫mero de filas.

In [6]:
# Ejemplo 1: muestra informaci√≥n estad√≠stica de las columnas del dataframe.

print(df.describe())

# Ejemplo 2: tambi√©n se puede sacar esa informaci√≥n seleccionando la columna a inspeccionar.

print("\n\n",df["Fare_per_Age"].describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

KeyError: 'Fare_per_Age'

## Shape

Shape devuelve una tupla con el n√∫mero de filas y columnas. Se usa para inspeccionar r√°pidamente el tama√±o de un conjunto de datos sin imprimirlo completo.

In [ ]:
# Ejemplo:

print(df.shape)

## Columns

Columns devuelve los nombres de las columnas. Se usa para inspeccionar, renombrar o manipular las columnas de un dataset.

In [ ]:
# Ejemplo 1: te devuelve la lista de todas las columnas.

print(df.columns)

# Ejemplo 2: Puedes referir a una columna en espec√≠fico seg√∫n su index.

print(df.columns[0])

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
PassengerId


# üîç Step 2: Selecting Data

Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

## ["column"]

Devuelve una serie que contiene los valores de la columna a la que te refieras. Es una de las formas m√°s comunes y directas de acceder a los datos de una columna dentro de un DataFrame.

In [ ]:
# Ejemplo 1: Todos los registros de la columna "Name"
print(df["Name"])

# Ejemplo 2: Todos los registros de "Age" + 10
print(df["Age"]+10)

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object
0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: Age, Length: 891, dtype: float64

## [["col1","col2"]]

Devuelve un dataframe con las columnas especificadas. Se usa para seleccionar y trabajar sobre las columnas deseadas dentro de un dataframe m√°s extenso.

In [ ]:
# Ejemplo 1: Lista de "Name" y "Age".
print(df[["Name","Age"]])

# Ejemplo 2: Lista de "Name" y "Age" sumandole 10 a todas estas.
nombreEdad = df[["Name","Age"]]
nombreEdad["Age"] = nombreEdad["Age"]+10
print(nombreEdad)

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]
                                                  Name   Age
0                              Braund, Mr. Owen Harris  32.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  48.0
2                               Heikkinen, Miss. Laina  36.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  45.0
4                             Allen, Mr. William Henry  45.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  37.0
887                       Graham, Miss. Margaret Edith  29.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  36.0
890                                Dooley, Mr. Patrick  42.0

[891 rows x 2 columns]

/tmp/ipykernel_1686/3277612336.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nombreEdad["Age"] = nombreEdad["Age"]+10

## Loc[]

Permite seleccionar filas y columnas por sus etiquetas (no por posici√≥n num√©rica). Puede usarse para filtrar filas por condiciones, seleccionar columnas espec√≠ficas o asignar valores.

In [ ]:
# Ejemplo 1: primeros 10 registros de "Name" y "Age"
print(df.loc[0:10, ["Name","Age"]])

# Ejemplo 2: todos los registros de "Name" y "Age" de los menores de 18 a√±os
print(df.loc[df["Age"] < 18, ["Name","Age"]])

                                                 Name   Age
0                             Braund, Mr. Owen Harris  22.0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                              Heikkinen, Miss. Laina  26.0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                            Allen, Mr. William Henry  35.0
5                                    Moran, Mr. James   NaN
6                             McCarthy, Mr. Timothy J  54.0
7                      Palsson, Master. Gosta Leonard   2.0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0
10                    Sandstrom, Miss. Marguerite Rut   4.0
                                        Name   Age
7             Palsson, Master. Gosta Leonard   2.0
9        Nasser, Mrs. Nicholas (Adele Achem)  14.0
10           Sandstrom, Miss. Marguerite Rut   4.0
14      Vestrom, Miss. Hulda Amanda Adolfina  14.0
16                      Rice, Master. Eugene   2.0
..                                       ...   ...
850  Andersson, Master. Sigvard Harald Elias   4.0
852                  Boulos, Miss. Nourelain   9.0
853                Lines, Miss. Mary Conover  16.0
869          Johnson, Master. Harold Theodor   4.0
875         Najib, Miss. Adele Kiamie "Jane"  15.0

[113 rows x 2 columns]

## Iloc[]

Permite seleccionar filas y columnas por posici√≥n entera (√≠ndices num√©ricos). A diferencia de loc[], que trabaja con etiquetas, iloc[] siempre utiliza posiciones basadas en cero.

In [ ]:
# Ejemplo 1: filas y columnas de la 5 a la 10
print(df.iloc[5:10, 5:10])

# Ejemplo 2: primeros dos registros mostrados al rev√©s
print(df.iloc[:2,::-1])

    Age  SibSp  Parch  Ticket     Fare
5   NaN      0      0  330877   8.4583
6  54.0      0      0   17463  51.8625
7   2.0      3      1  349909  21.0750
8  27.0      0      2  347742  11.1333
9  14.0      1      0  237736  30.0708
  Embarked Cabin     Fare     Ticket  Parch  SibSp   Age     Sex  \
0        S   NaN   7.2500  A/5 21171      0      1  22.0    male
1        C   C85  71.2833   PC 17599      0      1  38.0  female

                                                Name  Pclass  Survived  \
0                            Braund, Mr. Owen Harris       3         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1         1

   PassengerId
0            1
1            2


# üîé Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

## ["Age" > 30]

Genera una Serie de valores True/False. Luego, df[...] devuelve √∫nicamente las filas donde la condici√≥n es True. Es el mecanismo est√°ndar en pandas para filtrar registros seg√∫n una condici√≥n.

In [ ]:
# Ejemplo 1: todos los registros de los mayores de 30 a√±os
print(df[df["Age"] > 30])

# Ejemplo 2: los campos de "Name", "Age" y "Fare" de los menores de 18 a√±os
df[df["Age"] < 18][["Name","Age","Fare"]]

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
4              5         0       3
6              7         0       1
11            12         1       1
..           ...       ...     ...
873          874         0       3
879          880         1       1
881          882         0       3
885          886         0       3
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
881                                 Markun, Mr. Johann    male  33.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
3        0    113803  53.1000  C123        S
4        0    373450   8.0500   NaN        S
6        0     17463  51.8625   E46        S
11       0    113783  26.5500  C103        S
..     ...       ...      ...   ...      ...
873      0    345765   9.0000   NaN        S
879      1     11767  83.1583   C50        C
881      0    349257   7.8958   NaN        S
885      5    382652  29.1250   NaN        Q
890      0    370376   7.7500   NaN        Q

[305 rows x 12 columns]

                                        Name   Age     Fare
7             Palsson, Master. Gosta Leonard   2.0  21.0750
9        Nasser, Mrs. Nicholas (Adele Achem)  14.0  30.0708
10           Sandstrom, Miss. Marguerite Rut   4.0  16.7000
14      Vestrom, Miss. Hulda Amanda Adolfina  14.0   7.8542
16                      Rice, Master. Eugene   2.0  29.1250
..                                       ...   ...      ...
850  Andersson, Master. Sigvard Harald Elias   4.0  31.2750
852                  Boulos, Miss. Nourelain   9.0  15.2458
853                Lines, Miss. Mary Conover  16.0  39.4000
869          Johnson, Master. Harold Theodor   4.0  11.1333
875         Najib, Miss. Adele Kiamie "Jane"  15.0   7.2250

[113 rows x 3 columns]

## Query()

Permite filtrar filas de un DataFrame utilizando una sintaxis similar a expresiones l√≥gicas en SQL, lo que mejora la legibilidad frente a filtros largos con corchetes. Dentro del m√©todo se escribe una cadena con la condici√≥n, usando directamente los nombres de las columnas.

In [ ]:
# Ejemplo 1: todos los registros de los menores de 18 a√±os
df.query("Age < 18")

# Ejemplo 2: menores de 18 a√±os que han sobrevivido
df.query("Age < 18 and Survived == 1")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,0,0,330923,8.0292,NaN,Q
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,1,0,2651,11.2417,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
853,854,1,1,"Lines, Miss. Mary Conover",female,16.00,0,1,PC 17592,39.4000,D28,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,0,0,2667,7.2250,NaN,C


# üßπ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

## Isna()

Detecta valores nulos en el DataFrame y devuelve un DataFrame de booleanos (True si el valor es nulo, False si no lo es).

In [ ]:
# Ejemplo 1: comprobacion de nulos por columna de los primeros 5 registros
print(df.isna().head())

# Ejemplo 2: comprobacion de nulos en una columna especifica en los primeros 5 registros
print(df["Cabin"].isna().head())

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0        False     False   False  False  False  False  False  False   False
1        False     False   False  False  False  False  False  False   False
2        False     False   False  False  False  False  False  False   False
3        False     False   False  False  False  False  False  False   False
4        False     False   False  False  False  False  False  False   False

    Fare  Cabin  Embarked
0  False   True     False
1  False  False     False
2  False   True     False
3  False  False     False
4  False   True     False
0     True
1    False
2     True
3    False
4     True
Name: Cabin, dtype: bool

## Isna().sum()

Combina isna() con sum() para contar cu√°ntos valores nulos hay en cada columna del DataFrame.

In [ ]:
# Ejemplo 1: suma de los valores nulos por columna
print(df.isna().sum())

# Ejemplo 2: Numero de nulos de una columna espec√≠fica
print(f"N√∫mero de nulos de Age --> {df["Age"].isna().sum()}")

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
N√∫mero de nulos de Age --> 177

## Dropna()

Elimina filas (o columnas) que contienen valores nulos (NaN).

In [ ]:
# Ejemplo 1: primeros 5 registros que no contienen nulos.
print(df.dropna().head())

# Ejemplo 2: primeros 5 registros sin las columnas que contenian alg√∫n nulo en general.
print(df.dropna(axis=1).head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
10           11         1       3
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
10                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
10      1   PP 9549  16.7000    G6        S
11      0    113783  26.5500  C103        S
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex  SibSp  Parch  \
0                            Braund, Mr. Owen Harris    male      1      0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female      1      0
2                             Heikkinen, Miss. Laina  female      0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female      1      0
4                           Allen, Mr. William Henry    male      0      0

             Ticket     Fare
0         A/5 21171   7.2500
1          PC 17599  71.2833
2  STON/O2. 3101282   7.9250
3            113803  53.1000
4            373450   8.0500

## Fillna()

Rellena los valores nulos (NaN) con un valor espec√≠fico o con alg√∫n m√©todo como promedio, adelante, atr√°s, etc.

In [ ]:
# Ejemplo 1: relleno de 0 en los nulos de age
df["Age"].fillna(0)
print(f"N√∫mero de nulos en Age despu√©s del fillna() --> {df["Age"].isna().sum()}")
# Ejemplo 2: rellenado de nulos en cabin con la palabra unknown
df["Cabin"] = df["Cabin"].fillna("Unknown")
print(df["Cabin"].head())
print(df.isna().sum())

N√∫mero de nulos en Age despu√©s del fillna() --> 0
0    Unknown
1        C85
2    Unknown
3       C123
4    Unknown
Name: Cabin, dtype: object
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64


# üìä Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

## Groupby()[].mean()

Agrupa los datos por una o m√°s columnas y calcula el promedio de otra columna num√©rica.

In [ ]:
# Ejemplo 1: precio medio de las clases del titanic.
print(df.groupby(["Pclass"])["Fare"].mean())

# Ejemplo 2: precio medio de las clases del titanic por g√©nero.
print(df.groupby(["Pclass","Sex"])["Fare"].mean())

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64
Pclass  Sex
1       female    106.125798
        male       67.226127
2       female     21.970121
        male       19.741782
3       female     16.118810
        male       12.661633
Name: Fare, dtype: float64

## [].mean()

Calcula la media de los datos de la columna especificada siempre que sean datos num√©ricos.

In [ ]:
# Ejemplo 1: Media de precio del ticket del titanic.
print(f" Precio medio: {df["Fare"].mean()}")

# Ejemplo 2: Edad promedia de los tripulantes del titanic.
print(f"Edad promedia: {df["Age"].mean()}")

 Precio medio: 32.204207968574636
Edad promedia: 29.69911764705882

## [].median()

Saca la mediana de los datos de la columna especificada siempre que sean datos num√©ricos.

In [ ]:
# Ejemplo 1: Mediana de precio del ticket del titanic.
print(f" Precio mediano: {df["Fare"].median()}")

# Ejemplo 2: Edad mediana de los tripulantes del titanic.
print(f"Edad mediana: {df["Age"].median()}")

 Precio mediano: 14.4542
Edad mediana: 28.0


# üìà Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

## sort_values()

Ordena el DataFrame seg√∫n los valores de una o m√°s columnas.

In [ ]:
# Ejemplo 1: tabla ordenada de menor a mayor seg√∫n la edad.
print(df.sort_values("Age").head())

# Ejemplo 2: tabla ordenada de menor a mayor seg√∫n la edad y el precio pagado.
print(df.sort_values(["Age", "Fare"]).head())

     PassengerId  Survived  Pclass                             Name     Sex  \
803          804         1       3  Thomas, Master. Assad Alexander    male
755          756         1       2        Hamalainen, Master. Viljo    male
644          645         1       3           Baclini, Miss. Eugenie  female
469          470         1       3    Baclini, Miss. Helene Barbara  female
78            79         1       2    Caldwell, Master. Alden Gates    male

      Age  SibSp  Parch  Ticket     Fare Cabin Embarked
803  0.42      0      1    2625   8.5167   NaN        C
755  0.67      1      1  250649  14.5000   NaN        S
644  0.75      2      1    2666  19.2583   NaN        C
469  0.75      2      1    2666  19.2583   NaN        C
78   0.83      0      2  248738  29.0000   NaN        S
     PassengerId  Survived  Pclass                             Name     Sex  \
803          804         1       3  Thomas, Master. Assad Alexander    male
755          756         1       2        Hamalainen, Master. Viljo    male
469          470         1       3    Baclini, Miss. Helene Barbara  female
644          645         1       3           Baclini, Miss. Eugenie  female
831          832         1       2  Richards, Master. George Sibley    male

      Age  SibSp  Parch  Ticket     Fare Cabin Embarked
803  0.42      0      1    2625   8.5167   NaN        C
755  0.67      1      1  250649  14.5000   NaN        S
469  0.75      2      1    2666  19.2583   NaN        C
644  0.75      2      1    2666  19.2583   NaN        C
831  0.83      1      1   29106  18.7500   NaN        S

## unique()

Devuelve un array con los valores √∫nicos de una columna quitando los duplicados si existen.

In [ ]:
# Ejemplo 1: datos recogidos dentro de "Pclass" en formato array.
print(df["Pclass"].unique())

# Ejemplo 2: n√∫mero de registros recogidos dentro de "Pclass".
print(len(df["Pclass"].unique()))

[3 1 2]
3

## value_counts()

Cuenta cu√°ntas veces aparece cada valor √∫nico en una columna.

In [ ]:
# Ejemplo 1: n√∫mero de personas por clase 
print(df["Pclass"].value_counts())

# Ejemplo 2: n√∫mero de personas por clase normalizado
print(df["Pclass"].value_counts(normalize=True))

Pclass
3    491
1    216
2    184
Name: count, dtype: int64
Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64


# ‚öôÔ∏è Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

## Assign()

Crea nuevas columnas o modifica existentes sin alterar el DataFrame original, devolviendo una copia con los cambios.

In [ ]:
# Ejemplo 1: nuevo dataframe con el a√±o de nacimiento de los tripulantes 
# (suponiendo que el dataframe es actual)
print(df.assign(YearOfBirth = abs(df["Age"] - 2025)).head())

# Ejemplo 2: nuevo dataframe con una columna que guarda la edad dentro de 10 a√±os.
print(df.assign(Age_in_10_Years = df["Age"] + 10).head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  YearOfBirth
0      0         A/5 21171   7.2500   NaN        S       2003.0
1      0          PC 17599  71.2833   C85        C       1987.0
2      0  STON/O2. 3101282   7.9250   NaN        S       1999.0
3      0            113803  53.1000  C123        S       1990.0
4      0            373450   8.0500   NaN        S       1990.0
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  Age_in_10_Years
0      0         A/5 21171   7.2500   NaN        S             32.0
1      0          PC 17599  71.2833   C85        C             48.0
2      0  STON/O2. 3101282   7.9250   NaN        S             36.0
3      0            113803  53.1000  C123        S             45.0
4      0            373450   8.0500   NaN        S             45.0

## Apply()

Aplica una funci√≥n (propia o de Python) a cada elemento, fila o columna del DataFrame o Series.

In [ ]:
# Ejemplo 1: suma de las edades de los tripulantes
dfnn = df.fillna({"Age":0})
print(dfnn[["Age"]].apply(sum))

# Ejemplo 2: edades de los tripulantes * 2.
print(df[["Age"]].apply(lambda x: x*2).head())

Age    21205.17
dtype: float64
    Age
0  44.0
1  76.0
2  52.0
3  70.0
4  70.0

## ["new_col"] = ...

Crea o modifica una columna en el DataFrame asign√°ndole un valor, lista o c√°lculo.

In [ ]:
# Ejemplo 1: a√±adir columna booleana de adultos.
df["Adulto"] = df["Age"] >= 18
print(df.head())

# Ejemplo 2: a√±adir columna sumandole 10 a las edades en "Age".
df["Age_in_10_Years"] = df["Age"] + 10
print(df)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  Adulto  Age_in_10_Years
0      0         A/5 21171   7.2500   NaN        S    True             32.0
1      0          PC 17599  71.2833   C85        C    True             48.0
2      0  STON/O2. 3101282   7.9250   NaN        S    True             36.0
3      0            113803  53.1000  C123        S    True             45.0
4      0            373450   8.0500   NaN        S    True             45.0
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Adulto  Age_in_10_Years
0        0         A/5 21171   7.2500   NaN        S    True             32.0
1        0          PC 17599  71.2833   C85        C    True             48.0
2        0  STON/O2. 3101282   7.9250   NaN        S    True             36.0
3        0            113803  53.1000  C123        S    True             45.0
4        0            373450   8.0500   NaN        S    True             45.0
..     ...               ...      ...   ...      ...     ...              ...
886      0            211536  13.0000   NaN        S    True             37.0
887      0            112053  30.0000   B42        S    True             29.0
888      2        W./C. 6607  23.4500   NaN        S   False              NaN
889      0            111369  30.0000  C148        C    True             36.0
890      0            370376   7.7500   NaN        Q    True             42.0

[891 rows x 14 columns]

## Concat()

Combina varios DataFrames en uno solo, ya sea vertical u horizontalmente.

In [ ]:
# Ejemplo 1:


# Ejemplo 2:

## Merge()

In [ ]:
# Ejemplo 1:


# Ejemplo 2:


## üíæ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

In [ ]:

# Example: Save cleaned data
df.to_csv("titanic_cleaned.csv", index=False)


## üß© Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?